G0rocks/mechatronics-2_C-libraries/samd21g18a/samd21g18a_pointers.h
// PAC OFFSETS- Peripheral Access Controller, chapter 11.6
#define PAC_WPCLR_OFFSET ((unsigned int) 0x00) // Write protection clear register,
#define PAC_WPSET_OFFSET ((unsigned int) 0x04) // Write protection set register,

// PAC0 - Peripheral Access Controller 0, chapter 11.6
#define PAC0 ((unsigned int) 0x40000000) // See product mapping AHB-APB bridge C.
#define PAC0_ptr ((unsigned char*) PAC0) // See product mapping AHB-APB bridge C.
#define PAC0_WPCLR ((register_type) {(unsigned char) 4, (unsigned int) (PAC0 + PAC_WPCLR_OFFSET)}) // Write protection clear register, 11.6.2.1.1
#define PAC0_WPSET ((register_type) {(unsigned char) 4, (unsigned int) (PAC0 + PAC_WPSET_OFFSET)}) // Write protection set register, 11.6.2.1.2

// PAC1 - Peripheral Access Controller 1, chapter 11.6
#define PAC1 ((unsigned int) 0x41000000) // See product mapping AHB-APB bridge C.
#define PAC1_ptr ((unsigned char*) PAC1) // See product mapping AHB-APB bridge C.
#define PAC1_WPCLR ((register_type) {(unsigned char) 4, (unsigned int) (PAC1 + PAC_WPCLR_OFFSET)}) // Write protection clear register, 11.6.2.2.1
#define PAC1_WPSET ((register_type) {(unsigned char) 4, (unsigned int) (PAC1 + PAC_WPSET_OFFSET)}) // Write protection set register, 11.6.2.2.2

// PAC2 - Peripheral Access Controller 2, chapter 11.6
#define PAC2 ((unsigned int) 0x42000000) // See product mapping AHB-APB bridge C.
#define PAC2_ptr ((unsigned char*) PAC2) // See product mapping AHB-APB bridge C.
#define PAC2_WPCLR ((register_type) {(unsigned char) 4, (unsigned int) (PAC2 + PAC_WPCLR_OFFSET)}) // Write protection clear register, 11.6.2.3.1
#define PAC2_WPSET ((register_type) {(unsigned char) 4, (unsigned int) (PAC2 + PAC_WPSET_OFFSET)}) // Write protection set register, 11.6.2.3.2


// SERCOM OFFSETS- Serial Communication Interface, chapter 25
#define SERCOM_CTRLA_OFFSET ((unsigned int) 0x00) // Control A register, 26.7
#define SERCOM_CTRLB_OFFSET ((unsigned int) 0x04) // Control B register, 26.7
#define SERCOM_BAUD_OFFSET ((unsigned int) 0x0C) // Baud rate register, 26.7
#define SERCOM_RXPL_OFFSET ((unsigned int) 0x0E) // Receive pulse length register, 26.7
#define SERCOM_INTENCLR_OFFSET ((unsigned int) 0x14) // Interrupt enable clear register, 26.7
#define SERCOM_INTENSET_OFFSET ((unsigned int) 0x16) // Interrupt enable set register, 26.7
#define SERCOM_INTFLAG_OFFSET ((unsigned int) 0x18) // Interrupt flag status and clear register, 26.7
#define SERCOM_STATUS_OFFSET ((unsigned int) 0x1A) // Status register, 26.7
#define SERCOM_SYNCBUSY_OFFSET ((unsigned int) 0x1C) // Synchronization busy register, 26.7
#define SERCOM_DATA_OFFSET ((unsigned int) 0x28) // Data register, 26.7
#define SERCOM_DBGCTRL_OFFSET ((unsigned int) 0x30) // Debug control register, 26.7

// SERCOM0 - Serial Communication Interface 3, chapter 25
#define SERCOM0 ((unsigned int) 0x42000800) // See product mapping AHB-APB bridge C.
#define SERCOM0_ptr ((unsigned char*) SERCOM0) // See product mapping AHB-APB bridge C.
#define SERCOM0_CTRLA ((register_type) {(unsigned char) 4, (unsigned int)(SERCOM0 + SERCOM_CTRLA_OFFSET)}) // Output Clear Register, 23.8.6
#define SERCOM0_CTRLB ((register_type) {(unsigned char) 4, (unsigned int) (SERCOM0 + SERCOM_CTRLB_OFFSET)}) // Control B register, 26.7
#define SERCOM0_BAUD ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM0 + SERCOM_BAUD_OFFSET)}) // Baud rate register, 26.7
#define SERCOM0_RXPL ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM0 + SERCOM_RXPL_OFFSET)}) // Receive pulse length register, 26.7
#define SERCOM0_INTENCLR ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM0 + SERCOM_INTENCLR_OFFSET)}) // Interrupt enable clear register, 26.7
#define SERCOM0_INTENSET ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM0 + SERCOM_INTENSET_OFFSET)}) // Interrupt enable set register, 26.7
#define SERCOM0_INTFLAG ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM0 + SERCOM_INTFLAG_OFFSET)}) // Interrupt flag status and clear register, 26.7
#define SERCOM0_STATUS ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM0 + SERCOM_STATUS_OFFSET)}) // Status register, 26.7
#define SERCOM0_SYNCBUSY ((register_type) {(unsigned char) 4, (unsigned int) (SERCOM0 + SERCOM_SYNCBUSY_OFFSET)}) // Synchronization busy register, 26.7
#define SERCOM0_DATA ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM0 + SERCOM_DATA_OFFSET)}) // Data register, 26.7
#define SERCOM0_DBGCTRL ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM0 + SERCOM_DBGCTRL_OFFSET)}) // Debug control register, 26.7

// SERCOM1 - Serial Communication Interface 3, chapter 25
#define SERCOM1 ((unsigned int) 0x42000800) // See product mapping AHB-APB bridge C.
#define SERCOM1_ptr ((unsigned char*) SERCOM1) // See product mapping AHB-APB bridge C.
#define SERCOM1_CTRLA ((register_type) {(unsigned char) 4, (unsigned int)(SERCOM1 + SERCOM_CTRLA_OFFSET)}) // Output Clear Register, 23.8.6
#define SERCOM1_CTRLB ((register_type) {(unsigned char) 4, (unsigned int) (SERCOM1 + SERCOM_CTRLB_OFFSET)}) // Control B register, 26.7
#define SERCOM1_BAUD ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM1 + SERCOM_BAUD_OFFSET)}) // Baud rate register, 26.7
#define SERCOM1_RXPL ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM1 + SERCOM_RXPL_OFFSET)}) // Receive pulse length register, 26.7
#define SERCOM1_INTENCLR ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM1 + SERCOM_INTENCLR_OFFSET)}) // Interrupt enable clear register, 26.7
#define SERCOM1_INTENSET ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM1 + SERCOM_INTENSET_OFFSET)}) // Interrupt enable set register, 26.7
#define SERCOM1_INTFLAG ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM1 + SERCOM_INTFLAG_OFFSET)}) // Interrupt flag status and clear register, 26.7
#define SERCOM1_STATUS ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM1 + SERCOM_STATUS_OFFSET)}) // Status register, 26.7
#define SERCOM1_SYNCBUSY ((register_type) {(unsigned char) 4, (unsigned int) (SERCOM1 + SERCOM_SYNCBUSY_OFFSET)}) // Synchronization busy register, 26.7
#define SERCOM1_DATA ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM1 + SERCOM_DATA_OFFSET)}) // Data register, 26.7
#define SERCOM1_DBGCTRL ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM1 + SERCOM_DBGCTRL_OFFSET)}) // Debug control register, 26.7

