G0rocks/mechatronics-2_C-libraries/samd21g18a/samd21g18a_pointers.h
// SERCOM2 - Serial Communication Interface 3, chapter 25
#define SERCOM2 ((unsigned int) 0x42000800) // See product mapping AHB-APB bridge C.
#define SERCOM2_ptr ((unsigned char*) SERCOM2) // See product mapping AHB-APB bridge C.
#define SERCOM2_CTRLA ((register_type) {(unsigned char) 4, (unsigned int)(SERCOM2 + SERCOM_CTRLA_OFFSET)}) // Output Clear Register, 23.8.6
#define SERCOM2_CTRLB ((register_type) {(unsigned char) 4, (unsigned int) (SERCOM2 + SERCOM_CTRLB_OFFSET)}) // Control B register, 26.7
#define SERCOM2_BAUD ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM2 + SERCOM_BAUD_OFFSET)}) // Baud rate register, 26.7
#define SERCOM2_RXPL ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM2 + SERCOM_RXPL_OFFSET)}) // Receive pulse length register, 26.7
#define SERCOM2_INTENCLR ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM2 + SERCOM_INTENCLR_OFFSET)}) // Interrupt enable clear register, 26.7
#define SERCOM2_INTENSET ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM2 + SERCOM_INTENSET_OFFSET)}) // Interrupt enable set register, 26.7
#define SERCOM2_INTFLAG ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM2 + SERCOM_INTFLAG_OFFSET)}) // Interrupt flag status and clear register, 26.7
#define SERCOM2_STATUS ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM2 + SERCOM_STATUS_OFFSET)}) // Status register, 26.7
#define SERCOM2_SYNCBUSY ((register_type) {(unsigned char) 4, (unsigned int) (SERCOM2 + SERCOM_SYNCBUSY_OFFSET)}) // Synchronization busy register, 26.7
#define SERCOM2_DATA ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM2 + SERCOM_DATA_OFFSET)}) // Data register, 26.7
#define SERCOM2_DBGCTRL ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM2 + SERCOM_DBGCTRL_OFFSET)}) // Debug control register, 26.7

// SERCOM3 - Serial Communication Interface 3, chapter 25
#define SERCOM3 ((unsigned int) 0x42000800) // See product mapping AHB-APB bridge C.
#define SERCOM3_ptr ((unsigned char*) SERCOM3) // See product mapping AHB-APB bridge C.
#define SERCOM3_CTRLA ((register_type) {(unsigned char) 4, (unsigned int)(SERCOM3 + SERCOM_CTRLA_OFFSET)}) // Output Clear Register, 23.8.6
#define SERCOM3_CTRLB ((register_type) {(unsigned char) 4, (unsigned int) (SERCOM3 + SERCOM_CTRLB_OFFSET)}) // Control B register, 26.7
#define SERCOM3_BAUD ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM3 + SERCOM_BAUD_OFFSET)}) // Baud rate register, 26.7
#define SERCOM3_RXPL ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM3 + SERCOM_RXPL_OFFSET)}) // Receive pulse length register, 26.7
#define SERCOM3_INTENCLR ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM3 + SERCOM_INTENCLR_OFFSET)}) // Interrupt enable clear register, 26.7
#define SERCOM3_INTENSET ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM3 + SERCOM_INTENSET_OFFSET)}) // Interrupt enable set register, 26.7
#define SERCOM3_INTFLAG ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM3 + SERCOM_INTFLAG_OFFSET)}) // Interrupt flag status and clear register, 26.7
#define SERCOM3_STATUS ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM3 + SERCOM_STATUS_OFFSET)}) // Status register, 26.7
#define SERCOM3_SYNCBUSY ((register_type) {(unsigned char) 4, (unsigned int) (SERCOM3 + SERCOM_SYNCBUSY_OFFSET)}) // Synchronization busy register, 26.7
#define SERCOM3_DATA ((register_type) {(unsigned char) 2, (unsigned int) (SERCOM3 + SERCOM_DATA_OFFSET)}) // Data register, 26.7
#define SERCOM3_DBGCTRL ((register_type) {(unsigned char) 1, (unsigned int) (SERCOM3 + SERCOM_DBGCTRL_OFFSET)}) // Debug control register, 26.7



// TC3 - Timer Counter 3, chapter 30
#define TC3 ((unsigned int)  0x42002C00) // See product mapping AHB-APB bridge C.
#define TC3_ptr ((unsigned char*) 0x42002C00) // See product mapping AHB-APB bridge C.
#define TC3_CTRLA ((register_type) {(unsigned char) 2, (unsigned int) (TC3 + 0x00)}) // Control A register, 30.8.1


// ADC - Analog to Digital Converter, chapter 33
#define ADC ((unsigned char) 0x42004000) // See product mapping AHB-APB bridge C.
#define ADC_ptr ((unsigned char*) 0x42004000) // See product mapping AHB-APB bridge C.
#define ADC_CTRLA ((register_type) {(unsigned char) 1, (unsigned int) (ADC + 0x00)}) // Control A register, 33.8.1
#define ADC_STATUS ((register_type) {(unsigned char) 1, (unsigned int) (ADC + 0x19)}) // 33.8.13


#endif // _samd21g18a_pointers_